Documents/РегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РегламентированныйОтчет</Name>
			<Comment>(Общ)</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчетности</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбраннаяФорма</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
					<Comment>(Общ) Сохраненные данные отчета</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Comment>(Общ) Дата подписи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеревоНастройкиСтраниц</Name>
					<Comment>(Общ) Дерево со списком настроек страниц</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Comment>(Общ) Имя встроенной или имя файла внешней обработки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОтчета</Name>
					<Comment>(Общ) Наименование регламентированного отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПачки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>(Общ) Периодичность представления отчета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьЕдиницыИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РегламентированныйОтчет/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мСкопированаФорма = Неопределено;
	
	НеОтображатьПредупреждение = Параметры.НеОтображатьПредупреждение;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.ВыбраннаяФорма) Тогда
		
		мСкопированаФорма = Объект.ВыбраннаяФорма;
		
	КонецЕсли;
	
	Если Не(РеквизитФормыВЗначение("Объект").ЭтоНовый()) ИЛИ (мСкопированаФорма <> Неопределено) Тогда
		
		ПравоДоступаКОтчету = РегламентированнаяОтчетностьВызовСервера.ПравоДоступаКРегламентированномуОтчету(
			Объект.ИсточникОтчета);
		
		Если ПравоДоступаКОтчету = Ложь Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Недостаточно прав!';uk='Недостатньо прав!'");
			Сообщение.Сообщить();
			
			Возврат;
			
		ИначеЕсли ПравоДоступаКОтчету = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не удалось открыть сохраненные данные! Отчет не найден!';uk='Не вдалося відкрити збережені дані! Звіт не знайдений!'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		// Возвращает типы ВнешнийОтчетОбъект.<Имя> и ОтчетМенеджер.<Имя>
		ВариантФормыОтчета = Неопределено;
		ОбъектОтчет = РегламентированнаяОтчетность.РеглОтчеты(Объект.ИсточникОтчета);
		
		Если ОбъектОтчет = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не удалось открыть сохраненные данные! Отчет не найден!';uk='Не вдалося відкрити збережені дані! Звіт не знайдений!'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		ОткрытьФормуОтчета = Истина;
		ВариантФормыОтчета = ?(Найти(ОбъектОтчет, "ОтчетМенеджер") > 0, "Отчет.", "ВнешнийОтчет.")
		
	ИначеЕсли РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
		
		ОткрытьФормуОтчета = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	Если ОткрытьФормуОтчета Тогда
		
		СтандартнаяОбработка = Истина;
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", НачалоДня(Объект.ДатаНачала));
		ПараметрыФормы.Вставить("мСкопированаФорма",        мСкопированаФорма);
		ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  КонецДня(Объект.ДатаОкончания));
		ПараметрыФормы.Вставить("мПериодичность",           Объект.Периодичность);
		ПараметрыФормы.Вставить("Организация",              Объект.Организация);
		ПараметрыФормы.Вставить("мВыбраннаяФорма",          Объект.ВыбраннаяФорма);
		ПараметрыФормы.Вставить("НеОтображатьПредупреждение", НеОтображатьПредупреждение);
		
			
		Если мСкопированаФорма = Неопределено Тогда
			
			ПараметрыФормы.Вставить("мСохраненныйДок", Объект.Ссылка);
			
			ВыбраннаяФорма = Объект.ВыбраннаяФорма;
			
			ЭтоВнешнийОтчет = (ВариантФормыОтчета = "ВнешнийОтчет.");
			
			Если НЕ РегламентированнаяОтчетностьВызовСервера.ФормаРегламентированногоОтчетаСуществует(ЭтоВнешнийОтчет, Объект.ИсточникОтчета, ВыбраннаяФорма) Тогда
				ТекстПредупреждения = НСтр("ru='Отчет не может быть открыт! Данная редакция формы отчета не поддерживается текущей версией конфигурации.';uk='Звіт не може бути відкритий! Дана редакція форми звіту не підтримується поточною версією конфігурації.'");
				ПоказатьПредупреждение(, ТекстПредупреждения, 5 );
				Возврат;
			Иначе
				Если  РегламентированнаяОтчетностьВызовСервера.ЭтоОбычнаяФормаРегламентированногоОтчета(ЭтоВнешнийОтчет, Объект.ИсточникОтчета, ВыбраннаяФорма) Тогда
					
					#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
						Если ЭтоВнешнийОтчет Тогда
							#Если ТолстыйКлиентУправляемоеПриложение Тогда
								ТекстПредупреждения = НСтр("ru='Вы пытаетесь открыть архивный регламентированный отчет, созданный в предыдущей редакции конфигурации ВНЕШНИМ (подключенным) отчетом.
|Данное действие можно осуществить запустив платформу в режиме ""Толстый клиент (обычное приложение)""! 
|Запустите платформу в указанном режиме и повторите попытку.';uk='Ви намагаєтеся відкрити архівний регламентований звіт, 
|створений у попередній редакції конфігурації ЗОВНІШНІМ 
|(підключеним) звітом.
|Дану дію можна виконати запустивши платформу в 
|режимі ""Товстий клієнт (звичайний додаток)""! 
|Запустіть платформу в зазначеному режимі і повторіть спробу.'");
								ПоказатьПредупреждение(, ТекстПредупреждения, 5 );
								Возврат;
							#Иначе
								ВремОтчет = РегламентированнаяОтчетность.РеглОтчеты(Объект.ИсточникОтчета);
								ВыбФорма = ВремОтчет.ПолучитьФорму(ВыбраннаяФорма);	 
							#КонецЕсли
						Иначе	
							ВыбФорма = Отчеты[Объект.ИсточникОтчета].ПолучитьФорму(ВыбраннаяФорма);	 
						КонецЕсли;
						ВыбФорма.мСохраненныйДок 			= Объект.Ссылка;
						ВыбФорма.мДатаНачалаПериодаОтчета 	= Объект.ДатаНачала;
						ВыбФорма.мДатаКонцаПериодаОтчета  	= Объект.ДатаОкончания;
						ВыбФорма.Открыть();
					#Иначе
						ТекстПредупреждения = НСтр("ru='Вы пытаетесь открыть архивный регламентированный отчет, созданный в предыдущей редакции конфигурации.
|Данное действие можно осуществить запустив платформу в режиме ""Толстый клиент (управляемое приложение)""! 
|Запустите платформу в указанном режиме и повторите попытку.';uk='Ви намагаєтеся відкрити архівний регламентований звіт, 
|створений у попередній редакції конфігурації.
|Дану дію можна виконати запустивши платформу в 
|режимі ""Товстий клієнт (керований додаток)""! 
|Запустіть платформу в зазначеному режимі і повторіть спробу.'");
						ПоказатьПредупреждение(, ТекстПредупреждения, 5 );
						Возврат;
					#КонецЕсли
					
					Возврат;
				Иначе
					ФормаОтчета = ПолучитьФорму(ВариантФормыОтчета + Объект.ИсточникОтчета
						+ ".Форма." + ВыбраннаяФорма, ПараметрыФормы, , Объект.Ссылка);
					
					ФормаОтчета.СтруктураРеквизитовФормы.Организация = Объект.Организация;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Если Владелецформы.Имя = "Отчеты" Тогда
				ПараметрыФормы.Вставить("мСохраненныйДок", Владелецформы.ТекущиеДанные.РегламентированныйОтчет);
			Иначе
				ПараметрыФормы.Вставить("мСохраненныйДок", Владелецформы.ТекущаяСтрока);
			КонецЕсли;
			
			ФормаОтчета = ПолучитьФорму(ВариантФормыОтчета + Объект.ИсточникОтчета
			+ ".Форма.ОсновнаяФорма", ПараметрыФормы, , Объект.Ссылка);
			
			ФормаОтчета.Организация = Объект.Организация;
			
		КонецЕсли;
			
		
		Если СтандартнаяОбработка Тогда
			
			ФормаОтчета.ЗакрыватьПриЗакрытииВладельца = Ложь;
			
			ФормаОтчета.Открыть();
			
		КонецЕсли;

		
	Иначе
		
		//ОткрытьФорму("Справочник.РегламентированныеОтчеты.Форма.ФормаСписка");
		
	КонецЕсли;
	
КонецПроцедуры
